logs/delivery_receipt_service_20150607.log

2015-06-07T01:53:57+02:00|DEBUG|delivery|Ssg\Controller\DeliveryController|receipt|raw-request-data|<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
   <soapenv:Header>
      <v2:NotifySOAPHeader>
         <v2:timeStamp>20100904042855</v2:timeStamp>
         <v2:subReqID>11111111111111</v2:subReqID>
         <traceUniqueID>504021503311009040428550001002</traceUniqueID>
      </v2:NotifySOAPHeader>
   </soapenv:Header>
   <soapenv:Body>
      <loc:notifySmsDeliveryReceipt>
         <loc:correlator>123456791</loc:correlator>
         <loc:deliveryStatus>
            <address>tel:254722123456</address>
            <deliveryStatus>DeliveredToTerminal</deliveryStatus>
         </loc:deliveryStatus>
      </loc:notifySmsDeliveryReceipt>
   </soapenv:Body>
</soapenv:Envelope>
2015-06-07T01:53:57+02:00|DEBUG|delivery|Ssg\Model\DeliveryModel|decode|parse-xml|parameters_extracted:{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal"}|repeated_parameters:[]
2015-06-07T01:53:57+02:00|ERROR|delivery|Ssg\Model\DeliveryModel|save||error executing the query|INSERT INTO tbl_delivery_receipts (time_stamp, sub_req_id, trace_unique_id, correlator, dest_address, delivery_status, created_on) VALUES (:time_stamp, :sub_req_id, :trace_unique_id, :correlator, :dest_address, :delivery_status, NOW());|bind_parameters:null
2015-06-07T01:53:57+02:00|INFO|delivery|Ssg\Controller\DeliveryController|receipt|process-delivery-receipt-result|5|Error executing a query.|
2015-06-07T01:54:19+02:00|DEBUG|delivery|Ssg\Controller\DeliveryController|receipt|raw-request-data|<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
   <soapenv:Header>
      <v2:NotifySOAPHeader>
         <v2:timeStamp>20100904042855</v2:timeStamp>
         <v2:subReqID>11111111111111</v2:subReqID>
         <traceUniqueID>504021503311009040428550001002</traceUniqueID>
      </v2:NotifySOAPHeader>
   </soapenv:Header>
   <soapenv:Body>
      <loc:notifySmsDeliveryReceipt>
         <loc:correlator>123456791</loc:correlator>
         <loc:deliveryStatus>
            <address>tel:254722123456</address>
            <deliveryStatus>DeliveredToTerminal</deliveryStatus>
         </loc:deliveryStatus>
      </loc:notifySmsDeliveryReceipt>
   </soapenv:Body>
</soapenv:Envelope>
2015-06-07T01:54:19+02:00|DEBUG|delivery|Ssg\Model\DeliveryModel|decode|parse-xml|parameters_extracted:{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal"}|repeated_parameters:[]
2015-06-07T01:54:19+02:00|ERROR|delivery|Ssg\Model\DeliveryModel|save||error executing the query|INSERT INTO tbl_delivery_receipts (time_stamp, sub_req_id, trace_unique_id, correlator, dest_address, delivery_status, created_on) VALUES (:time_stamp, :sub_req_id, :trace_unique_id, :correlator, :dest_address, :delivery_status, NOW());|bind_parameters:null
2015-06-07T01:54:19+02:00|INFO|delivery|Ssg\Controller\DeliveryController|receipt|process-delivery-receipt-result|5|Error executing a query.|
2015-06-07T01:54:29+02:00|DEBUG|delivery|Ssg\Controller\DeliveryController|receipt|raw-request-data|<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
   <soapenv:Header>
      <v2:NotifySOAPHeader>
         <v2:timeStamp>20100904042855</v2:timeStamp>
         <v2:subReqID>11111111111111</v2:subReqID>
         <traceUniqueID>504021503311009040428550001002</traceUniqueID>
      </v2:NotifySOAPHeader>
   </soapenv:Header>
   <soapenv:Body>
      <loc:notifySmsDeliveryReceipt>
         <loc:correlator>123456791</loc:correlator>
         <loc:deliveryStatus>
            <address>tel:254722123456</address>
            <deliveryStatus>DeliveredToTerminal</deliveryStatus>
         </loc:deliveryStatus>
      </loc:notifySmsDeliveryReceipt>
   </soapenv:Body>
</soapenv:Envelope>
2015-06-07T01:54:29+02:00|DEBUG|delivery|Ssg\Model\DeliveryModel|decode|parse-xml|parameters_extracted:{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal"}|repeated_parameters:[]
2015-06-07T01:54:29+02:00|ERROR|delivery|Ssg\Model\DeliveryModel|save||error executing the query|INSERT INTO tbl_delivery_receipts (time_stamp, sub_req_id, trace_unique_id, correlator, dest_address, delivery_status, created_on) VALUES (:time_stamp, :sub_req_id, :trace_unique_id, :correlator, :dest_address, :delivery_status, NOW());|bind_parameters:{":time_stamp":"20100904042855",":sub_req_id":"11111111111111",":trace_unique_id":"504021503311009040428550001002",":correlator":"123456791",":dest_address":"tel:254722123456",":delivery_status":"DeliveredToTerminal"}
2015-06-07T01:54:29+02:00|INFO|delivery|Ssg\Controller\DeliveryController|receipt|process-delivery-receipt-result|5|Error executing a query.|
2015-06-07T01:54:47+02:00|DEBUG|delivery|Ssg\Controller\DeliveryController|receipt|raw-request-data|<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
   <soapenv:Header>
      <v2:NotifySOAPHeader>
         <v2:timeStamp>20100904042855</v2:timeStamp>
         <v2:subReqID>11111111111111</v2:subReqID>
         <traceUniqueID>504021503311009040428550001002</traceUniqueID>
      </v2:NotifySOAPHeader>
   </soapenv:Header>
   <soapenv:Body>
      <loc:notifySmsDeliveryReceipt>
         <loc:correlator>123456791</loc:correlator>
         <loc:deliveryStatus>
            <address>tel:254722123456</address>
            <deliveryStatus>DeliveredToTerminal</deliveryStatus>
         </loc:deliveryStatus>
      </loc:notifySmsDeliveryReceipt>
   </soapenv:Body>
</soapenv:Envelope>
2015-06-07T01:54:47+02:00|DEBUG|delivery|Ssg\Model\DeliveryModel|decode|parse-xml|parameters_extracted:{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal"}|repeated_parameters:[]
2015-06-07T01:54:47+02:00|INFO|delivery|Ssg\Controller\DeliveryController|receipt|process-delivery-receipt-result|0|Processing successful|20100904042855|11111111111111|504021503311009040428550001002|123456791|tel:254722123456|DeliveredToTerminal|18|0
2015-06-07T02:17:28+02:00|DEBUG|delivery|Ssg\Controller\DeliveryController|receipt|raw-request-data|<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
   <soapenv:Header>
      <v2:NotifySOAPHeader>
         <v2:timeStamp>20100904042855</v2:timeStamp>
         <v2:subReqID>11111111111111</v2:subReqID>
         <traceUniqueID>504021503311009040428550001002</traceUniqueID>
      </v2:NotifySOAPHeader>
   </soapenv:Header>
   <soapenv:Body>
      <loc:notifySmsDeliveryReceipt>
         <loc:correlator>123456791</loc:correlator>
         <loc:deliveryStatus>
            <address>tel:254722123456</address>
            <deliveryStatus>DeliveredToTerminal</deliveryStatus>
         </loc:deliveryStatus>
      </loc:notifySmsDeliveryReceipt>
   </soapenv:Body>
</soapenv:Envelope>
2015-06-07T02:17:28+02:00|DEBUG|delivery|Ssg\Model\DeliveryModel|decode|parse-xml|parameters_extracted:{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal"}|repeated_parameters:[]
2015-06-07T02:17:28+02:00|INFO|delivery|Ssg\Controller\DeliveryController|receipt|process-delivery-receipt-result|0|Processing successful|{"timeStamp":"20100904042855","subReqID":"11111111111111","traceUniqueID":"504021503311009040428550001002","correlator":"123456791","address":"tel:254722123456","deliveryStatus":"DeliveredToTerminal","_lastInsertID":"19","_recordsUpdated":0}
